export type Faculty = {
  name: string;
  majors: string[];
};

export const UP_FACULTIES: Faculty[] = [
  {
    name: "คณะเกษตรศาสตร์และทรัพยากรธรรมชาติ",
    majors: ["เกษตรศาสตร์", "การประมง", "สัตวศาสตร์", "ความปลอดภัยทางอาหาร", "วิทยาศาสตร์และเทคโนโลยีการอาหาร", "เทคโนโลยีนวัตกรรมการประมง", "เทคโนโลยีการเกษตร"],
  },
  {
    name: "คณะเทคโนโลยีสารสนเทศและการสื่อสาร",
    majors: ["วิทยาการคอมพิวเตอร์", "เทคโนโลยีสารสนเทศ", "วิศวกรรมซอฟต์แวร์", "วิศวกรรมคอมพิวเตอร์", "ภูมิสารสนเทศศาสตร์", "วิทยาการข้อมูลและการประยุกต์"],
  },
  {
    name: "คณะวิทยาศาสตร์",
    majors: ["คณิตศาสตร์", "สถิติ", "เคมี", "ฟิสิกส์", "ชีววิทยา", "จุลชีววิทยา", "วิทยาศาสตร์การแพทย์", "วิทยาศาสตร์สิ่งแวดล้อม", "วิทยาศาสตร์เครื่องสำอาง"],
  },
  {
    name: "คณะวิศวกรรมศาสตร์",
    majors: ["วิศวกรรมโยธา", "วิศวกรรมไฟฟ้า", "วิศวกรรมเครื่องกล", "วิศวกรรมอุตสาหการ", "วิศวกรรมเหมืองแร่", "วิศวกรรมสิ่งแวดล้อม", "วิศวกรรมวัสดุ"],
  },
  {
    name: "คณะพลังงานและสิ่งแวดล้อม",
    majors: ["วิทยาศาสตร์และเทคโนโลยีสิ่งแวดล้อม", "เทคโนโลยีพลังงาน"],
  },
  {
    name: "คณะแพทยศาสตร์",
    majors: ["แพทยศาสตร์"],
  },
  {
    name: "คณะทันตแพทยศาสตร์",
    majors: ["ทันตแพทยศาสตร์"],
  },
  {
    name: "คณะพยาบาลศาสตร์",
    majors: ["พยาบาลศาสตร์"],
  },
  {
    name: "คณะเภสัชศาสตร์",
    majors: ["เภสัชศาสตร์"],
  },
  {
    name: "คณะวิทยาศาสตร์การแพทย์",
    majors: ["กายวิภาคศาสตร์และชีววิทยาของเซลล์", "ชีวเคมี", "นิติวิทยาศาสตร์", "พยาธิวิทยา", "สรีรวิทยา"],
  },
  {
    name: "คณะสหเวชศาสตร์",
    majors: ["เทคนิคการแพทย์", "กายภาพบำบัด", "อาชีวอนามัยและความปลอดภัย"],
  },
  {
    name: "คณะนิติศาสตร์",
    majors: ["นิติศาสตร์"],
  },
  {
    name: "คณะรัฐศาสตร์และสังคมศาสตร์",
    majors: ["รัฐศาสตร์", "รัฐประศาสนศาสตร์", "สังคมวิทยาและมานุษยวิทยา", "พัฒนาสังคม", "สังคมสงเคราะห์ศาสตร์"],
  },
  {
    name: "คณะบริหารธุรกิจและนิเทศศาสตร์",
    majors: ["บริหารธุรกิจ", "การตลาด", "การเงิน", "การบัญชี", "ธุรกิจดิจิทัล", "การจัดการการสื่อสาร", "นิเทศศาสตร์"],
  },
  {
    name: "คณะศิลปศาสตร์",
    majors: ["ภาษาไทย", "ภาษาอังกฤษ", "ภาษาจีน", "ภาษาฝรั่งเศส", "ภาษาญี่ปุ่น"],
  },
  {
    name: "คณะสถาปัตยกรรมศาสตร์และศิลปกรรมศาสตร์",
    majors: ["สถาปัตยกรรม", "ออกแบบผลิตภัณฑ์", "ทัศนศิลป์", "นาฏศิลป์และการแสดง", "ดนตรี", "คอมพิวเตอร์กราฟิกและมัลติมีเดีย"],
  },
  {
    name: "คณะเศรษฐศาสตร์และบริหารธุรกิจ",
    majors: ["เศรษฐศาสตร์"],
  },
  {
    name: "วิทยาลัยการศึกษา",
    majors: ["การศึกษา", "การประถมศึกษา", "วิทยาศาสตร์การกีฬา", "คณิตศาสตร์ศึกษา", "ภาษาไทยศึกษา", "ภาษาอังกฤษศึกษา", "ชีววิทยาศึกษา", "ฟิสิกส์ศึกษา"],
  },
  {
    name: "วิทยาเขตเชียงราย",
    majors: ["ทันตแพทยศาสตร์ (เชียงราย)"],
  },
];